1s/ERP/Conf/Documents/Лико_ЗаявкаНаОтгрузку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ЗаявкаНаОтгрузку</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Лико_ПараметрыОтрузки</xr:Item>
				<xr:Item>AccumulationRegister.Лико_ЗаявкиНаОтгрузку</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ТипыЗаявокНаТранспортировку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_СостоянияЗаявокНаТранспортировку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>оставил как служебный реквизит для префиксации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОтгрузки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ТипыОтгрузкиГотовойПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияПродавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданаНаОснованииЗаданияНаСписаниеГП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловияПоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Площадка</Name>
					<Comment>Для склада лк Металлострой ГП - Ликофлекс, для склада ИКС ГП - ИксПак</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ШаблоныЗаявокНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданаИзЗаказаСчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказКлиента</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_НомераПоставок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаЦены</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресДоставки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресДоставкиЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетНаОплату</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Лико_СчетНаОплатуКлиенту</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКомплекта</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтгрузкаВРублях</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Грузополучатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Втулка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_Втулки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Намотка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_Намотка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодЭтикеткиЗаказчика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерГруппировки</Name>
							<Comment>имеет смысл, когда комплект состоит из позиций с разным количеством (несколько позиций формируют собой "подкомплекты")</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеальныйДоговор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтгрузитьВсе</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧестныйЗнак</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_ЧестныйЗнак</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДляДоступаСлужебная</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Менеджер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БизнесРегионы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗаказа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Лико_ТипыЗаказов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ТипыОтгрузкиГотовойПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ТипыОтгрузкиГотовойПродукции</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РеализацияКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеНаСкладРегиона</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеНаСкладРегиона2</Name>
					<Comment>В программе делает тоже самое, что и "ПеремещениеНаСкладРегиона"</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеКлиентуИСписаниеСОрганизацииПродавца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеСОрганизацииПроизводителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияКлиентуСПеремещениемНаСкладХранения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеКлиентуСоСкладаХранения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеСоСкладаХранения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеМеждуСкладамиХранения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияКлиентуЧерезСкладРегиона</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеНаСкладОтвХраненияДругойПлощадки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеСоСкладаОтвХраненияДругойПлощадки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ЗаявкаНаОтгрузку/Forms/ФормаПодбора/Ext/Form/Module.bsl
&НаКлиенте
Процедура ДеревоПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПередНачаломИзменения(Элемент, Отказ)
	
	Если НЕ (Элемент.ТекущийЭлемент.Имя = "ДеревоВыбранныеСтроки" ИЛИ Элемент.ТекущийЭлемент.Имя = "ДеревоКоличество") Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДерево(Команда)
	ОбновитьДеревоНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьДеревоНаСервере()
	
	Дерево.ПолучитьЭлементы().Очистить();
	
	Если ТипПодбора <> "ПоСпискуЗаказов" И НЕ ЗначениеЗаполнено(ОтборСклад) тогда
		Сообщить("Не заполнено поле ""Склад"".");
		Возврат;
	КонецЕсли;
	
	Если ТипПодбора = "ОстаткиПоНоменклатуре" Тогда
		СтрокаСортировки = "
		|Номенклатура,
		|Характеристика,
		|ЗаказКлиента";
	Иначе
		СтрокаСортировки = "
		|НомерЗаказа,
		|Номенклатура,
		|Характеристика";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Если ТипПодбора = "ПоСпискуЗаказов" Тогда
		Запрос.Текст = Документы.Лико_ЗаявкаНаОтгрузку.ПолучитьТекстЗапросаДляДереваЗаказы(СтрокаСортировки);
		// Последние полгода
		Запрос.УстановитьПараметр("Дата", ДатаНачалаЗаказов);
		Запрос.УстановитьПараметр("ОтборНеПоказыватьЗаказыВСостоянииСоздан", Элементы.НеПоказыватьЗаказыВСостоянииСоздан.Видимость И ОтборНеПоказыватьЗаказыВСостоянииСоздан);
		Элементы.ОтборСклад.Видимость = Ложь;
	Иначе
		Запрос.Текст = Документы.Лико_ЗаявкаНаОтгрузку.ПолучитьТекстЗапросаДляДереваОстатки(СтрокаСортировки, ОтборСклад.ИспользоватьАдресноеХранение);
		МассивСкладов = Новый Массив;
		Если ЗначениеЗаполнено(ОтборСклад) Тогда
			МассивСкладов.Добавить(ОтборСклад);
			Если ЗначениеЗаполнено(ДополнительныйСклад) Тогда
				МассивСкладов.Добавить(ДополнительныйСклад);
			КонецЕсли;
		КонецЕсли;
		Запрос.УстановитьПараметр("Склады", МассивСкладов);
		Запрос.УстановитьПараметр("ОтборПоСкладуУстановлен", МассивСкладов.Количество() > 0);
		МассивЯчеек = Новый Массив;
		Для каждого ТекСклад из МассивСкладов Цикл 
			МассивЯчеек.Добавить(Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, ТекСклад, "ЯчейкаРастарка", Справочники.СкладскиеЯчейки.ПустаяСсылка()));
			Если НЕ Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, ТекСклад, "ПодбиратьОстаткиИзЯчейкиУпаковки_ea01b5f3f4a1470cbcb8a690e7aaf194", Ложь) Тогда
				МассивЯчеек.Добавить(Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, ТекСклад, "ЯчейкаУпаковка", Справочники.СкладскиеЯчейки.ПустаяСсылка()));
			КонецЕсли;
		КонецЦикла;
		
		Запрос.УстановитьПараметр("ЯчейкаРастарка", МассивЯчеек);
		Запрос.УстановитьПараметр("ОтборПоЗаказам", Ложь);
		Запрос.УстановитьПараметр("МассивЗаказов", Неопределено);
		Элементы.ДатаНачалаЗаказов.Видимость = Ложь;
		Элементы.НеПоказыватьЗаказыВСостоянииСоздан.Видимость = Ложь;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Партнер", ?(ЗначениеЗаполнено(ОтборПартнер), ОтборПартнер, Неопределено));
	Запрос.УстановитьПараметр("Менеджер", ?(ЗначениеЗаполнено(ОтборМенеджер), ОтборМенеджер, Неопределено));
	
	РезЗапроса = Запрос.Выполнить();
	
	Выборка = РезЗапроса.Выбрать();
	
	Если Выборка <> Неопределено Тогда
		
		ТекРодитель = Неопределено;
		Пока Выборка.Следующий() Цикл
			Если ТипПодбора = "ОстаткиПоНоменклатуре" Тогда
				Если ТекРодитель <> Выборка.Номенклатура Тогда
					ТекРодитель	= Выборка.Номенклатура;
					ТекСтрокаРодитель = ДобавитьСтрокуРодителя(Выборка); 				 
				КонецЕсли;
			Иначе
				Если ТекРодитель <> Выборка.ЗаказКлиента Тогда
					ТекРодитель	= Выборка.ЗаказКлиента;
					ТекСтрокаРодитель = ДобавитьСтрокуРодителя(Выборка); 				 
				КонецЕсли;
			КонецЕсли;
			ДобавитьСтрокуПодчиненную(ТекСтрокаРодитель, Выборка);
			
		КонецЦикла;
		
		//Дерево.ПолучитьЭлементы().Сортировать("Наименование");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДобавитьСтрокуРодителя(Строкаданных)

	СтрокаДерева = Дерево.ПолучитьЭлементы().Добавить();
	Если ТипПодбора = "ОстаткиПоНоменклатуре" Тогда
		СтрокаДерева.Наименование = Строкаданных.ПредставлениеНоменклатуры;
	Иначе
		СтрокаДерева.Наименование = Строкаданных.НомерЗаказа;
		СтрокаДерева.Контрагент = Строкаданных.Контрагент;
	КонецЕсли;
	
	//СтрокаДерева.Город = Строкаданных.Город;
	//СтрокаДерева.Намотка = Строкаданных.Намотка;
		
	Возврат СтрокаДерева;
	
КонецФункции

&НаСервере
Функция ДобавитьСтрокуПодчиненную(СтрокаРодитель,Строкаданных)

   	СтрокаДерева = СтрокаРодитель.ПолучитьЭлементы().Добавить();
	
	Если ТипПодбора = "ОстаткиПоНоменклатуре" Тогда	
		СтрокаДерева.Наименование  = Строкаданных.НомерЗаказа;
	Иначе
		СтрокаДерева.Наименование = Строкаданных.ПредставлениеНоменклатуры;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(СтрокаДерева, Строкаданных);
	СтрокаРодитель.Количество	   = СтрокаРодитель.Количество+Строкаданных.Количество;

	Возврат СтрокаДерева;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Склад", ОтборСклад); 
	Параметры.Свойство("Дата", Дата);
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Сообщить("Необходимо заполнить дату отгрузки");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Параметры.Свойство("Документ", Документ); 
	Параметры.Свойство("Партнер", ОтборПартнер); 
	Параметры.Свойство("Менеджер", ОтборМенеджер);
	Параметры.Свойство("ТипОтгрузки", ТипОтгрузки);
	ТипПодбора = Параметры.ТипПодбора;
	Если ТипПодбора = "ПоСпискуЗаказов" Тогда
		ЭтаФорма.Заголовок = "Подбор по списку заказов";
		ДатаНачалаЗаказов = ДобавитьМесяц(ТекущаяДата(), -3);
	Иначе
		ЭтаФорма.Заголовок = "Подбор по остаткам";
	КонецЕсли;
	
	ЗаполнитьДопСклад();
		
	ОбновитьДеревоНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДопСклад()
	
	Элементы.ДополнительныйСклад.Видимость = Ложь;
	ДополнительныйСклад = Неопределено;
	Если ЗначениеЗаполнено(ОтборСклад) И ТипОтгрузки <> Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеНаСкладОтвХраненияДругойПлощадки Тогда
		СвязанныйСкладОтвХранения = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, ОтборСклад, "СвязанныйСкладОтвХранения_3c139bc2b738468bb14bc188eb15a0d0");
		Если ЗначениеЗаполнено(СвязанныйСкладОтвХранения) Тогда
			ДополнительныйСклад = СвязанныйСкладОтвХранения;
			Сообщить("Добавлены остатки по складу """ + ДополнительныйСклад + """");
			Элементы.ДополнительныйСклад.Видимость = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПриИзменении(Элемент)
	
	//Изменяется в дереве только колонка ВыбранныеСтроки 
	Если Элемент.ТекущийЭлемент.Имя = "ДеревоВыбранныеСтроки" Тогда
		Для каждого СтрокаДерева из Элемент.ТекущиеДанные.ПолучитьЭлементы() Цикл
			СтрокаДерева.ВыбранныеСтроки = Элемент.ТекущиеДанные.ВыбранныеСтроки;
			ТекПорядок = ТекПорядок + 1;
			СтрокаДерева.Порядок = ТекПорядок;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	ТаблицаДляПереноса.Очистить();
	Для каждого Строка из Дерево.ПолучитьЭлементы() Цикл
		Для каждого ПодчиненнаяСтрока из Строка.ПолучитьЭлементы() Цикл
			Если ПодчиненнаяСтрока.ВыбранныеСтроки Тогда
				НоваяСтрока = ТаблицаДляПереноса.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ПодчиненнаяСтрока);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	ТаблицаДляПереноса.Сортировать("Порядок");
	ЭтаФорма.Закрыть(ТаблицаДляПереноса);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПриИзменении(Элемент)
	
	Если Элемент.Имя = "ОтборСклад" Тогда
		ЗаполнитьДопСклад();
	КонецЕсли;
	
	ОбновитьДеревоНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискВДереве(Команда)
	
	Если ЭтаФорма.ВводДоступен() Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.ДеревоНаименование;
		WSHShell = Новый COMОбъект("WScript.Shell");
		WSHShell.SendKeys("^{f}");
		WSHShell.SendKeys("^{а}");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьДерево(Команда)
   СвернутьРекурсия(Дерево.ПолучитьЭлементы()); 
КонецПроцедуры

&НаКлиенте
Процедура СвернутьРекурсия(тЭлементы)
   Для Каждого тСтр Из тЭлементы Цикл
      СвернутьРекурсия(тСтр.ПолучитьЭлементы());
      Элементы.Дерево.Свернуть(тСтр.ПолучитьИдентификатор());
   КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДерево(Команда)
	Для Каждого тСтр Из Дерево.ПолучитьЭлементы() Цикл
		Элементы.Дерево.Развернуть(тСтр.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметитьВсе(Команда)
	Отметка = Команда.Имя = "ОтметитьВсе";
	Для каждого Строка из Дерево.ПолучитьЭлементы() Цикл
		Строка.ВыбранныеСтроки = Отметка;
		Для каждого ПодСтрока из Строка.ПолучитьЭлементы() Цикл
			ПодСтрока.ВыбранныеСтроки = Отметка;
		КонецЦикла;
	КонецЦикла;		
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныйСкладПриИзменении(Элемент)
	
	ОбновитьДеревоНаСервере();
	
КонецПроцедуры
